# Description

In [5]:
import pandas as pd
import os
from datetime import datetime

In [6]:
file_name = '../data/Dec Data.xlsx'

if os.path.exists(file_name):
    print('File exists')
else:
    print (os.listdir('../data'))
    assert False, 'File does not exist'

File exists

In [7]:
excel = pd.ExcelFile(file_name)
excel.sheet_names

['Salik Dec', 'Fine Dec', 'Bike History']

In [8]:
salik_sheets = [sheet for sheet in excel.sheet_names if 'salik' in sheet.lower()]
print(salik_sheets)

['Salik Dec']

In [9]:
df = excel.parse ("Salik Dec")
df.head()

   Transaction ID  Sponser  Trip Date  Plate  Amount (AED)
0     30701884457  Marahah 2024-11-30  45447          4.25
1     10813081408  Marahah 2024-12-31  53068          4.25
2     50413081500  Marahah 2024-12-31  17352          4.25
3     80812981498  Marahah 2024-12-31  30951          4.25
4     20912981696  Marahah 2024-12-31  53068          4.25

In [10]:
df.isna().sum()

Transaction ID    0
Sponser           0
Trip Date         0
Plate             0
Amount (AED)      0
dtype: int64

In [9]:
# data is clean but change dates to standard time fame

In [13]:
df[df.isna().any(axis=1)]

Empty DataFrame
Columns: [Transaction ID, Sponser, Trip Date, Plate, Amount (AED)]
Index: []

In [12]:
type (df['Trip Date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [13]:
df['Trip Date'][0].day

30

In [25]:
df.iloc[10:25].index.values + 2

array([12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26])

In [23]:
df.iloc[10:25]

    Transaction ID  Sponser  Trip Date  Plate  Amount (AED)
10     80312981151  Marahah 2024-12-31  67740          4.25
11     60612981745  Marahah 2024-12-31  67740          4.25
12     70812981538  Marahah 2024-12-31  50514          4.25
13     50412981634  Marahah 2024-12-31  45215          4.25
14       712981130  Marahah 2024-12-31  36674          4.25
15     10312981719  Marahah 2024-12-31  49744          4.25
16     60112981514  Marahah 2024-12-31  52681          4.25
17     10812981905  Marahah 2024-12-31  23508          4.25
18     70712881095  Marahah 2024-12-31  23508          4.25
19     70412881794  Marahah 2024-12-31  46100          4.25
20     20312881492  Marahah 2024-12-31  49741          4.25
21     40112881682  Marahah 2024-12-31  45602          4.25
22     50812881977  Marahah 2024-12-31  50221          4.25
23     50512881073  Marahah 2024-12-31  36746          4.25
24     90412881665  Marahah 2024-12-31  49741          4.25